# -*- coding: utf-8; -*-


valid_letters = "АВЕКМНОРСТУХ"
translit = {
    "А": "A",
    "В": "B",
    "Е": "E",
    "К": "K",
    "М": "M",
    "Н": "H",
    "О": "O",
    "Р": "P",
    "С": "C",
    "Т": "T",
    "У": "Y",
    "Х": "X",
}
invalid_letters = "БГДЁЖЗИЙЛПФЦЧШЩЪЫЬЭЮЯ"
valid_regions = [
    "01", "02", "03", "04", "05", "06", "07", "08", "09", "10",
    "11", "12", "13", "14", "15", "16", "17", "18", "19",
    "21", "22", "23", "24", "25", "26", "27", "28", "29", "30",
    "31", "32", "33", "34", "35", "36", "37", "38", "39", "40",
    "41", "42", "43", "44", "45", "46", "47", "48", "49", "50",
    "51", "52", "53", "54", "55", "56", "57", "58", "59", "60",
    "61", "62", "63", "64", "65", "66", "67", "68", "69", "70",
    "71", "72", "73", "74", "75", "76", "77", "78", "79", "80",
    "81", "82", "83", "84", "85", "86", "87", "88", "89", "90",
    "91", "92", "93", "94", "95", "96", "97", "98", "99",
    "102",
    "113", "116",
    "121", "123", "124", "125", "126",
    "134", "136", "138",
    "142", "150",
    "152", "154", "159",
    "161", "163", "164",
    "173", "174", "177", "178",
    "186", "190",
    "196", "197", "198", "199",
    "716", "750", "763", "777", "799",
]


class CarNumber:

    def __init__(self, number, region, valid=True):
        self.number = number
        self.region = region
        self.valid = bool(valid)

    def __eq__(self, other):
        return other is not None and self.number == other.number and self.region == other.region

    def __repr__(self):
        return " ".join(["Car number:", self.number, self.region])

    def __str__(self):
        return (" ".join([self.number, self.region])).strip()
